validationAndVerificationSuite/verification/GGI/bridgedOverlap/basicMesh-potentialFoam/Allrun
#!/bin/sh
# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application="potentialFoam"

runApplication blockMesh
\cp -r boundary constant/polyMesh/.

runApplication setSet -batch setBatch.batch
runApplication setsToZones -noFlipMap

runApplication $application
