validationAndVerificationSuite/verification/GGI/bridgedOverlap/basicMesh-potentialFoam/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 5)
    (1 0 5)
    (1 1 5)
    (0 1 5)

    (0 0 5)
    (1 0 5)
    (1 0.56 5)
    (0 0.56 5)
    (0 0 10)
    (1 0 10)
    (1 0.56 10)
    (0 0.56 10)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) stationary (1 1 2) simpleGrading (1 1 1)
    hex (8 9 10 11 12 13 14 15) moving (1 3 2) simpleGrading (1 1 1)
);

edges
(

);

boundary
(
    walls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (1 2 6 5)
            (2 3 7 6)
            (0 4 7 3)
            (9 10 14 13)
            (10 11 15 14)
            (8 12 15 11)
            (8 9 13 12)
        );
    }

    inlet
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (12 13 14 15)
        );
    }

    movingSlider
    {
        type patch;
        faces
        (
            (9 8 11 10)
        );
    }

    staticSlider
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
