validationAndVerificationSuite/verification/GGI/bridgedOverlap/basicMesh-potentialFoam/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           BiCGStab;
        preconditioner   Cholesky;

        minIter          0;
        maxIter          1000;
        tolerance        1e-10;
        relTol           0.0;
    }
    U
    {
        solver           BiCGStab;
        preconditioner   DILU;

        minIter          0;
        maxIter          1000;
        tolerance        1e-07;
        relTol           0;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
}

PISO
{
    nCorrectors              2;
    nNonOrthogonalCorrectors 0;
}

// ************************************************************************* //
